import random as r


familyNames = (
    "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
    "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
    "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
    "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
    "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
    "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
    "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
    "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
    "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
    "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹"
)

# 常用的名
givenNames = (
    "子璇", "淼", "国栋", "夫子", "瑞堂", "甜", "敏", "尚", "国贤", "贺祥", "晨涛",
    "昊轩", "易轩", "益辰", "益帆", "益冉", "瑾春", "瑾昆", "春齐", "杨", "文昊",
    "东东", "雄霖", "浩晨", "熙涵", "溶溶", "冰枫", "欣欣", "宜豪", "欣慧", "建政",
    "美欣", "淑慧", "文轩", "文杰", "欣源", "忠林", "榕润", "欣汝", "慧嘉", "新建",
    "建林", "亦菲", "林", "冰洁", "佳欣", "涵涵", "禹辰", "淳美", "泽惠", "伟洋",
    "涵越", "润丽", "翔", "淑华", "晶莹", "凌晶", "苒溪", "雨涵", "嘉怡", "佳毅",
    "子辰", "佳琪", "紫轩", "瑞辰", "昕蕊", "萌", "明远", "欣宜", "泽远", "欣怡",
    "佳怡", "佳惠", "晨茜", "晨璐", "运昊", "汝鑫", "淑君", "晶滢", "润莎", "榕汕",
    "佳钰", "佳玉", "晓庆", "一鸣", "语晨", "添池", "添昊", "雨泽", "雅晗", "雅涵",
    "清妍", "诗悦", "嘉乐", "晨涵", "天赫", "玥傲", "佳昊", "天昊", "萌萌", "若萌",
    "秀","娟","英","华","慧","巧","美","娜","静","淑","惠","珠","翠","雅","芝", "玉", "萍", 
    "红", "娥", "玲", "芬", "芳", "燕", "彩", "春", "菊", "兰", "凤", "洁", "梅", "琳", 
    "素", "云", "莲", "真", "环", "雪", "荣", "爱", "妹", "霞", "香","月", "莺", "媛", "艳", "瑞", "凡", "佳", "嘉", "琼", "勤", "珍", "贞", "莉", "桂",
)

years = [2014,2015,2016,2017,2018,2019]
months = [3, 6, 9, 12]

STU_NUM = 100
GRADE_NUM = 5

with open("data.sql","w", encoding="utf8") as f:
    # use database
    f.write("-- Use db\n")
    f.write("USE django_db;\n\n")

    f.write("-- Grade info\n")
    f.write("INSERT INTO grade(name,date,girlNum,boyNum,teacherNum,isDeleted) VALUES\n")
    for i in range(GRADE_NUM):
        f.write(
            "('%s', '%s', %d, %d, %d, %d)"%(
            "grade"+str(i+1), "%d-%d-%d"%(r.choice(years),r.choice(months),r.randint(1,15)),
            r.randint(20, 30),r.randint(20, 30), r.randint(5, 7), 0) 
            + ("," if i != GRADE_NUM-1 else ";") + "\n"
        )
    print(" grade ok",i)

    f.write("\n-- Student info\n")
    f.write("INSERT INTO student(name,age,gender,intro,height,weight,isDeleted,grade_id) VALUES\n")
    for j in range(STU_NUM):
        name = r.choice(familyNames) + r.choice(givenNames)
        f.write(
            "('%s', %d, %d,'%s', %.2f, %.2f, %d, %d)"%(
            name, r.randint(10, 16), r.randint(0,1),
            "大家好，我是"+name,r.random()*20 + 140,r.random()*20 + 35,
            0, r.randint(1,GRADE_NUM)) 
            + ("," if (j != STU_NUM-1) else ";") + "\n"
        )
    print(" student ok",j)

print(" file ok")
